{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<animal>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "</animal>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<breed>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "</breed>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<category>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "</category>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "<question>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "</question>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "<answer>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "</answer>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<animal>": 5,
      "</animal>": 6,
      "<breed>": 7,
      "</breed>": 8,
      "<category>": 9,
      "</category>": 10,
      "<question>": 11,
      "</question>": 12,
      "<answer>": 13,
      "</answer>": 14,
      ">": 15,
      "<": 16,
      ",": 17,
      "the": 18,
      "</": 19,
      ".": 20,
      "and": 21,
      "of": 22,
      "breed": 23,
      "animal": 24,
      "answer": 25,
      "category": 26,
      "question": 27,
      "to": 28,
      "a": 29,
      ".</": 30,
      "-": 31,
      "for": 32,
      "?</": 33,
      "in": 34,
      "their": 35,
      "agricultural": 36,
      "mammal": 37,
      "you": 38,
      "are": 39,
      "husbandry": 40,
      "is": 41,
      "physiological": 42,
      "veterinary": 43,
      "bird": 44,
      "commercial": 45,
      "with": 46,
      "that": 47,
      "general": 48,
      "environmental": 49,
      "The": 50,
      "reproductive": 51,
      "managing": 52,
      "What": 53,
      "management": 54,
      "Nepalese": 55,
      "rigorous": 56,
      "these": 57,
      "has": 58,
      "Nepal": 59,
      "In": 60,
      "genetic": 61,
      "feed": 62,
      "potential": 63,
      "cow": 64,
      "chicken": 65,
      "rabbit": 66,
      "ostrich": 67,
      "kalij": 68,
      "buffalo": 69,
      "goat": 70,
      "an": 71,
      "duck": 72,
      "pig": 73,
      "care": 74,
      "protocols": 75,
      "highly": 76,
      "essential": 77,
      "farmers": 78,
      "continuous": 79,
      "modern": 80,
      "superior": 81,
      "demands": 82,
      "its": 83,
      "infrastructure": 84,
      "raising": 85,
      "specific": 86,
      "or": 87,
      "on": 88,
      "'": 89,
      "endemic": 90,
      "this": 91,
      "housing": 92,
      "must": 93,
      "overall": 94,
      "conversion": 95,
      "ratio": 96,
      "yield": 97,
      "behavioral": 98,
      "unique": 99,
      "vaccination": 100,
      "From": 101,
      "perspective": 102,
      "productivity": 103,
      "growth": 104,
      "critical": 105,
      "cycle": 106,
      "gestational": 107,
      "A": 108,
      "To": 109,
      "can": 110,
      "sophisticated": 111,
      "proactive": 112,
      "when": 113,
      "treatments": 114,
      "prophylactic": 115,
      "Consequently": 116,
      "diseases": 117,
      "local": 118,
      "indigenous": 119,
      "astute": 120,
      "prioritize": 121,
      "circumvent": 122,
      "guarantees": 123,
      "become": 124,
      "concentrate": 125,
      "forage": 126,
      "metabolic": 127,
      "Ultimately": 128,
      "trajectory": 129,
      "conversation": 130,
      "robust": 131,
      "lucrative": 132,
      "scientific": 133,
      "Furthermore": 134,
      "during": 135,
      "requires": 136,
      "producers": 137,
      "resilience": 138,
      "When": 139,
      "remains": 140,
      "Therefore": 141,
      "long": 142,
      "sustainability": 143,
      "term": 144,
      "stock": 145,
      "both": 146,
      "paradigms": 147,
      "high": 148,
      "inevitably": 149,
      "inherent": 150,
      "maintaining": 151,
      "such": 152,
      "s": 153,
      "I": 154,
      "As": 155,
      "absolutely": 156,
      "success": 157,
      "White": 158,
      "biosecurity": 159,
      "into": 160,
      "animals": 161,
      "Can": 162,
      "Renowned": 163,
      "adaptability": 164,
      "climate": 165,
      "cohorts": 166,
      "controlled": 167,
      "globally": 168,
      "housed": 169,
      "thrive": 170,
      "Fundamentally": 171,
      "approach": 172,
      "balancing": 173,
      "control": 174,
      "meticulous": 175,
      "necessitates": 176,
      "nutritional": 177,
      "science": 178,
      "adhering": 179,
      "capable": 180,
      "developed": 181,
      "gross": 182,
      "margins": 183,
      "maximizing": 184,
      "meticulously": 185,
      "population": 186,
      "profit": 187,
      "strictly": 188,
      "summation": 189,
      "thriving": 190,
      "farm": 191,
      "access": 192,
      "ad": 193,
      "augments": 194,
      "digestion": 195,
      "dramatically": 196,
      "ensuring": 197,
      "libitum": 198,
      "throughput": 199,
      "uncontaminated": 200,
      "water": 201,
      "analysis": 202,
      "calibrated": 203,
      "caloric": 204,
      "daily": 205,
      "elevate": 206,
      "empirical": 207,
      "exponentially": 208,
      "intake": 209,
      "outcomes": 210,
      "precisely": 211,
      "ratios": 212,
      "reveals": 213,
      "Optimizing": 214,
      "acids": 215,
      "amalgamation": 216,
      "amino": 217,
      "carbohydrates": 218,
      "concentrates": 219,
      "dense": 220,
      "micronutrient": 221,
      "tailored": 222,
      "Stringent": 223,
      "catastrophic": 224,
      "including": 225,
      "incoming": 226,
      "isolation": 227,
      "negotiable": 228,
      "non": 229,
      "outbreaks": 230,
      "pathogenic": 231,
      "prevent": 232,
      "Hence": 233,
      "cement": 234,
      "foundation": 235,
      "operation": 236,
      "over": 237,
      "preventative": 238,
      "retroactive": 239,
      "Indeed": 240,
      "acute": 241,
      "associated": 242,
      "detriments": 243,
      "diagnostic": 244,
      "financial": 245,
      "preemptive": 246,
      "screenings": 247,
      "substantial": 248,
      "Subsequently": 249,
      "accelerated": 250,
      "actively": 251,
      "activity": 252,
      "greater": 253,
      "hormonal": 254,
      "implementation": 255,
      "manipulation": 256,
      "maturation": 257,
      "photoperiod": 258,
      "stimulate": 259,
      "advanced": 260,
      "health": 261,
      "integrating": 262,
      "monitoring": 263,
      "sensor": 264,
      "standard": 265,
      "technologies": 266,
      "ubiquitous": 267,
      "refinement": 268,
      "safeguard": 269,
      "welfare": 270,
      "blueprint": 271,
      "definitive": 272,
      "immaculate": 273,
      "selection": 274,
      "sustained": 275,
      "synthesis": 276,
      "techniques": 277,
      "allowing": 278,
      "cortisol": 279,
      "ethological": 280,
      "foraging": 281,
      "heavily": 282,
      "innate": 283,
      "pasture": 284,
      "reducing": 285,
      "repertoires": 286,
      "rotation": 287,
      "stimulates": 288,
      "structured": 289,
      "comprehend": 290,
      "first": 291,
      "focused": 292,
      "one": 293,
      "operations": 294,
      "ambient": 295,
      "architectures": 296,
      "construct": 297,
      "economically": 298,
      "enterprise": 299,
      "humidity": 300,
      "regulate": 301,
      "sustain": 302,
      "systemic": 303,
      "temperature": 304,
      "ventilated": 305,
      "viable": 306,
      "adherence": 307,
      "consistency": 308,
      "disciplined": 309,
      "methodologies": 310,
      "outputs": 311,
      "results": 312,
      "unparalleled": 313,
      ";": 314,
      "Their": 315,
      "absolute": 316,
      "anthropogenic": 317,
      "disturbances": 318,
      "external": 319,
      "imperative": 320,
      "minimizing": 321,
      "phases": 322,
      "stability": 323,
      "thus": 324,
      "cornerstone": 325,
      "due": 326,
      "enterprises": 327,
      "exceptional": 328,
      "represents": 329,
      "practices": 330,
      "integration": 331,
      "abiotic": 332,
      "around": 333,
      "centers": 334,
      "ensure": 335,
      "function": 336,
      "mitigating": 337,
      "near": 338,
      "overarching": 339,
      "peak": 340,
      "philosophy": 341,
      "stressors": 342,
      "localized": 343,
      "dietary": 344,
      "how": 345,
      "Discuss": 346,
      "strategies": 347,
      "optimal": 348,
      "economic": 349,
      "detail": 350,
      "viability": 351,
      "How": 352,
      "Himalayan": 353,
      "Black": 354,
      "do": 355,
      "provide": 356,
      "from": 357,
      "Neck": 358,
      "systems": 359,
      "Please": 360,
      "rural": 361,
      "mitigate": 362,
      "monsoon": 363,
      "exorbitant": 364,
      "like": 365,
      "Kathmandu": 366,
      "demand": 367,
      "within": 368,
      "traditional": 369,
      "Terai": 370,
      "altitudinal": 371,
      "formidable": 372,
      "severe": 373,
      "regions": 374,
      "quality": 375,
      "as": 376,
      "winter": 377,
      "detailed": 378,
      "comprehensive": 379,
      "characteristics": 380,
      "defining": 381,
      "idiosyncrasies": 382,
      "morphological": 383,
      "maximize": 384,
      "conditions": 385,
      "necessary": 386,
      "outline": 387,
      "elaborate": 388,
      "rate": 389,
      "disease": 390,
      "flock": 391,
      "healthy": 392,
      "herd": 393,
      "prevention": 394,
      "regimens": 395,
      "breeding": 396,
      "parameters": 397,
      "Could": 398,
      "overview": 399,
      "requirements": 400,
      "spatial": 401,
      "Red": 402,
      "!": 403,
      "farming": 404,
      "your": 405,
      "Runner": 406,
      "help": 407,
      "support": 408,
      "specialized": 409,
      "be": 410,
      "crested": 411,
      "Southern": 412,
      "Kalij": 413,
      "Masai": 414,
      "backed": 415,
      "Blue": 416,
      "Somali": 417,
      "Khaleej": 418,
      "knowledge": 419,
      "challenges": 420,
      "Lophura": 421,
      "leucomelanos": 422,
      "African": 423,
      "alongside": 424,
      "districts": 425,
      "efficacious": 426,
      "ethnoveterinary": 427,
      "isolated": 428,
      "leveraging": 429,
      "pharmacological": 430,
      "proven": 431,
      "Conclusively": 432,
      "advancing": 433,
      "intersection": 434,
      "landscape": 435,
      "promising": 436,
      "rearing": 437,
      "signifies": 438,
      "state": 439,
      "During": 440,
      "anthelmintic": 441,
      "commanding": 442,
      "epoch": 443,
      "increases": 444,
      "interventions": 445,
      "loads": 446,
      "parasitic": 447,
      "sharply": 448,
      "susceptibility": 449,
      "affecting": 450,
      "region": 451,
      "threats": 452,
      "across": 453,
      "constraints": 454,
      "context": 455,
      "demonstrates": 456,
      "diverse": 457,
      "gradients": 458,
      "phenotypic": 459,
      "plasticity": 460,
      "remarkable": 461,
      "topographical": 462,
      "varying": 463,
      "achieve": 464,
      "agriculturalists": 465,
      "empowers": 466,
      "synchronizing": 467,
      "unprecedented": 468,
      "Additionally": 469,
      "accumulation": 470,
      "adaptation": 471,
      "deployment": 472,
      "elevated": 473,
      "extreme": 474,
      "flooring": 475,
      "moisture": 476,
      "rains": 477,
      "slatted": 478,
      "torrential": 479,
      "widespread": 480,
      "byproducts": 481,
      "cake": 482,
      "costs": 483,
      "diets": 484,
      "imported": 485,
      "locally": 486,
      "maize": 487,
      "milled": 488,
      "mustard": 489,
      "supplement": 490,
      "acclimatization": 491,
      "agro": 492,
      "ecological": 493,
      "impacts": 494,
      "introducing": 495,
      "offset": 496,
      "sub": 497,
      "tropical": 498,
      "Governmental": 499,
      "alleviate": 500,
      "capital": 501,
      "cooperative": 502,
      "decentralized": 503,
      "expenditure": 504,
      "frameworks": 505,
      "initial": 506,
      "networks": 507,
      "periodically": 508,
      "required": 509,
      "subsidization": 510,
      "agrarian": 511,
      "been": 512,
      "by": 513,
      "catalyzed": 514,
      "domestic": 515,
      "economy": 516,
      "hubs": 517,
      "metropolitan": 518,
      "surging": 519,
      "Valley": 520,
      "areas": 521,
      "market": 522,
      "products": 523,
      "surrounding": 524,
      "availability": 525,
      "climatic": 526,
      "considerations": 527,
      "hilly": 528,
      "suitable": 529,
      "closing": 530,
      "impediments": 531,
      "infrastructural": 532,
      "overcoming": 533,
      "reality": 534,
      "tangible": 535,
      "theoretical": 536,
      "translates": 537,
      "cultivars": 538,
      "feeds": 539,
      "hurdle": 540,
      "innovative": 541,
      "logistical": 542,
      "necessitating": 543,
      "primary": 544,
      "procurement": 545,
      "utilization": 546,
      "investments": 547,
      "outreach": 548,
      "resilient": 549,
      "sector": 550,
      "secure": 551,
      "targeted": 552,
      "will": 553,
      "Moreover": 554,
      "chain": 555,
      "dependable": 556,
      "establishing": 557,
      "indispensable": 558,
      "logistics": 559,
      "mountainous": 560,
      "precarious": 561,
      "preserving": 562,
      "product": 563,
      "supply": 564,
      "terrain": 565,
      "traversing": 566,
      "Given": 567,
      "fragmented": 568,
      "hills": 569,
      "intensive": 570,
      "landholdings": 571,
      "mid": 572,
      "offers": 573,
      "often": 574,
      "opportunity": 575,
      "pragmatic": 576,
      "scaling": 577,
      "vertical": 578,
      "affect": 579,
      "body": 580,
      "compositions": 581,
      "condition": 582,
      "implies": 583,
      "intricately": 584,
      "maintain": 585,
      "microclimates": 586,
      "rates": 587,
      "recalibrated": 588,
      "scores": 589,
      "seasonally": 590,
      "which": 591,
      "Chitwan": 592,
      "Pokhara": 593,
      "agrotourism": 594,
      "amplified": 595,
      "flocks": 596,
      "herds": 597,
      "intrinsic": 598,
      "premium": 599,
      "proposition": 600,
      "synthetically": 601,
      "value": 602,
      "component": 603,
      "diversifying": 604,
      "increasingly": 605,
      "plains": 606,
      "recognized": 607,
      "revenue": 608,
      "smallholder": 609,
      "streams": 610,
      "sweeping": 611,
      "vital": 612,
      "cold": 613,
      "modify": 614,
      "protect": 615,
      "should": 616,
      "stress": 617,
      "variations": 618,
      "Thus": 619,
      "adaptive": 620,
      "ecologically": 621,
      "embracing": 622,
      "exceptionally": 623,
      "flexible": 624,
      "profitable": 625,
      "remain": 626,
      "sound": 627,
      "exposure": 628,
      "hypothermic": 629,
      "insulating": 630,
      "navigating": 631,
      "precipitous": 632,
      "shield": 633,
      "m": 634,
      "more": 635,
      "me": 636,
      "am": 637,
      "!</": 638,
      "here": 639,
      "Chester": 640,
      "Dutch": 641,
      "Saddleback": 642,
      "New": 643,
      "Zealand": 644,
      "Lionhead": 645,
      "English": 646,
      "Lop": 647,
      "Tamworth": 648,
      "Angora": 649,
      "Pietrain": 650,
      "California": 651,
      "Hampshire": 652,
      "Flemish": 653,
      "Giant": 654,
      "Chinchilla": 655,
      "Yorkshire": 656,
      "Rex": 657,
      "Duroc": 658,
      "Landrace": 659,
      "Large": 660,
      "Berkshire": 661,
      "Crested": 662,
      "Aylesbury": 663,
      "Call": 664,
      "Duck": 665,
      "Mallard": 666,
      "Indian": 667,
      "Pekin": 668,
      "Muscovy": 669,
      "Cayuga": 670,
      "Campbell": 671,
      "Khaki": 672,
      "Rouen": 673,
      "AI": 674,
      "need": 675,
      "Mediterranean": 676,
      "Mehsana": 677,
      "Parkote": 678,
      "Lime": 679,
      "Murrah": 680,
      "Toda": 681,
      "Jafarabadi": 682,
      "Surti": 683,
      "Pandharpuri": 684,
      "Swamp": 685,
      "Nili": 686,
      "Ravi": 687,
      "Bhadawari": 688,
      "data": 689,
      "Plymouth": 690,
      "Rock": 691,
      "Island": 692,
      "Rhode": 693,
      "Leghorn": 694,
      "Broiler": 695,
      "Australorp": 696,
      "Cornish": 697,
      "Silkie": 698,
      "Sussex": 699,
      "Wyandotte": 700,
      "Orpington": 701,
      "Brahma": 702,
      "Kadaknath": 703,
      "Kuroiler": 704,
      "questions": 705,
      "Brahman": 706,
      "Bengal": 707,
      "Guernsey": 708,
      "Siri": 709,
      "Beetal": 710,
      "Sinhal": 711,
      "Boer": 712,
      "today": 713,
      "Ayrshire": 714,
      "Saanen": 715,
      "Chyangra": 716,
      "Toggenburg": 717,
      "Brown": 718,
      "Swiss": 719,
      "Jersey": 720,
      "LaMancha": 721,
      "Hereford": 722,
      "Dexter": 723,
      "Holstein": 724,
      "Kiko": 725,
      "Charolais": 726,
      "Pashmina": 727,
      "Alpine": 728,
      "Nubian": 729,
      "Angus": 730,
      "Khari": 731,
      "Simmental": 732,
      "Pahari": 733,
      "Jamnapari": 734,
      "Limousin": 735,
      "know": 736,
      "assist": 737,
      "don": 738,
      "t": 739,
      "any": 740,
      "have": 741,
      "livestock": 742,
      "specifically": 743,
      "Good": 744,
      "what": 745,
      "?": 746,
      "they": 747,
      "chickens": 748,
      "Are": 749,
      "Who": 750,
      "day": 751,
      "give": 752,
      "so": 753,
      "accurate": 754,
      "advice": 755,
      "there": 756,
      "Hello": 757,
      "Hi": 758,
      "Tell": 759,
      "ready": 760,
      "just": 761,
      "Goodbye": 762,
      "if": 763,
      "Take": 764,
      "See": 765,
      "later": 766,
      "expert": 767,
      "needs": 768,
      "assistance": 769,
      "always": 770,
      "InvestoMart": 771,
      "created": 772,
      "Why": 773,
      "doing": 774,
      "it": 775,
      "My": 776,
      "consciousness": 777,
      "efficiently": 778,
      "experience": 779,
      "problems": 780,
      "process": 781,
      "purpose": 782,
      "simply": 783,
      "solve": 784,
      "goats": 785,
      "buffalos": 786,
      "but": 787,
      "Thanks": 788,
      "code": 789,
      "decisions": 790,
      "easier": 791,
      "informed": 792,
      "make": 793,
      "manifestation": 794,
      "Where": 795,
      "ducks": 796,
      "rabbits": 797,
      "cows": 798,
      "kalijs": 799,
      "ostrichs": 800,
      "pigs": 801,
      "Yes": 802,
      "details": 803,
      "information": 804,
      "most": 805,
      "Let": 806,
      "It": 807,
      "great": 808,
      "hear": 809,
      "mind": 810,
      "Greetings": 811,
      "might": 812,
      "If": 813,
      "You": 814,
      "ask": 815,
      "re": 816,
      "very": 817,
      "welcome": 818,
      "Wishing": 819,
      "Feel": 820,
      "free": 821,
      "return": 822,
      "Glad": 823,
      "could": 824,
      "Have": 825,
      "productive": 826,
      "wonderful": 827,
      "No": 828,
      "all": 829,
      "at": 830,
      "problem": 831,
      "artificial": 832,
      "intelligence": 833,
      "queries": 834,
      "built": 835,
      "crop": 836,
      "friendly": 837,
      "neighborhood": 838,
      "Assistant": 839,
      "trained": 840,
      "appreciate": 841,
      "functioning": 842,
      "perfectly": 843,
      "Hey": 844,
      "cross": 845,
      "did": 846,
      "get": 847,
      "road": 848,
      "side": 849,
      "udder": 850,
      "evening": 851,
      "name": 852,
      "Do": 853,
      "jokes": 854,
      "joke": 855,
      "life": 856,
      "meaning": 857,
      "up": 858,
      "morning": 859,
      "conscious": 860,
      "designed": 861,
      "insights": 862,
      "profitability": 863,
      "date": 864,
      "Because": 865,
      "break": 866,
      "d": 867,
      "dropped": 868,
      "eggs": 869,
      "lay": 870,
      "them": 871,
      "bull": 872,
      "bulldozer": 873,
      "call": 874,
      "sleeping": 875,
      "about": 876,
      "breeds": 877,
      "computer": 878,
      "different": 879,
      "emotions": 880,
      "face": 881,
      "feel": 882,
      "fully": 883,
      "much": 884,
      "operational": 885,
      "program": 886,
      "economics": 887,
      "providing": 888,
      "regarding": 889,
      "specialize": 890,
      "All": 891,
      "go": 892,
      "inquiries": 893,
      "Make": 894,
      "laugh": 895,
      "capabilities": 896,
      "digital": 897,
      "exist": 898,
      "fast": 899,
      "realm": 900,
      "running": 901,
      "servers": 902,
      "time": 903,
      "best": 904,
      "smart": 905,
      "Bye": 906,
      "find": 907,
      "home": 908,
      "physical": 909,
      "platform": 910,
      "right": 911,
      "Thank": 912,
      "learn": 913,
      "some": 914,
      "lot": 915,
      "live": 916,
      "everything": 917,
      "!?</": 918
    },
    "unk_token": "<unk>"
  }
}