{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"<animal>":5,"</animal>":6,"<breed>":7,"</breed>":8,"<category>":9,"</category>":10,"<question>":11,"</question>":12,"<answer>":13,"</answer>":14,"!":15,"\"":16,"#":17,"$":18,"%":19,"&":20,"'":21,"(":22,")":23,"*":24,"+":25,",":26,"-":27,".":28,"/":29,"0":30,"1":31,"2":32,"3":33,"4":34,"5":35,"6":36,"7":37,"8":38,"9":39,":":40,";":41,"<":42,"=":43,">":44,"?":45,"@":46,"A":47,"B":48,"C":49,"D":50,"E":51,"F":52,"G":53,"H":54,"I":55,"J":56,"K":57,"L":58,"M":59,"N":60,"O":61,"P":62,"Q":63,"R":64,"S":65,"T":66,"U":67,"V":68,"W":69,"X":70,"Y":71,"Z":72,"[":73,"\\":74,"]":75,"^":76,"_":77,"`":78,"a":79,"b":80,"c":81,"d":82,"e":83,"f":84,"g":85,"h":86,"i":87,"j":88,"k":89,"l":90,"m":91,"n":92,"o":93,"p":94,"q":95,"r":96,"s":97,"t":98,"u":99,"v":100,"w":101,"x":102,"y":103,"z":104,"{":105,"|":106,"}":107,"~":108,"ÂĄ":109,"Âą":110,"ÂŁ":111,"Â€":112,"Â„":113,"ÂŠ":114,"Â§":115,"Âš":116,"Â©":117,"ÂȘ":118,"Â«":119,"ÂŹ":120,"Âź":121,"ÂŻ":122,"Â°":123,"Â±":124,"ÂČ":125,"Âł":126,"ÂŽ":127,"Â”":128,"Â¶":129,"Â·":130,"Âž":131,"Âč":132,"Âș":133,"Â»":134,"ÂŒ":135,"Âœ":136,"ÂŸ":137,"Âż":138,"Ă":139,"Ă":140,"Ă":141,"Ă":142,"Ă":143,"Ă":144,"Ă":145,"Ă":146,"Ă":147,"Ă":148,"Ă":149,"Ă":150,"Ă":151,"Ă":152,"Ă":153,"Ă":154,"Ă":155,"Ă":156,"Ă":157,"Ă":158,"Ă":159,"Ă":160,"Ă":161,"Ă":162,"Ă":163,"Ă":164,"Ă":165,"Ă":166,"Ă":167,"Ă":168,"Ă":169,"Ă":170,"Ă ":171,"ĂĄ":172,"Ăą":173,"ĂŁ":174,"Ă€":175,"Ă„":176,"ĂŠ":177,"Ă§":178,"Ăš":179,"Ă©":180,"ĂȘ":181,"Ă«":182,"ĂŹ":183,"Ă­":184,"Ăź":185,"ĂŻ":186,"Ă°":187,"Ă±":188,"ĂČ":189,"Ăł":190,"ĂŽ":191,"Ă”":192,"Ă¶":193,"Ă·":194,"Ăž":195,"Ăč":196,"Ăș":197,"Ă»":198,"ĂŒ":199,"Ăœ":200,"ĂŸ":201,"Ăż":202,"Ä":203,"Ä":204,"Ä":205,"Ä":206,"Ä":207,"Ä":208,"Ä":209,"Ä":210,"Ä":211,"Ä":212,"Ä":213,"Ä":214,"Ä":215,"Ä":216,"Ä":217,"Ä":218,"Ä":219,"Ä":220,"Ä":221,"Ä":222,"Ä":223,"Ä":224,"Ä":225,"Ä":226,"Ä":227,"Ä":228,"Ä":229,"Ä":230,"Ä":231,"Ä":232,"Ä":233,"Ä":234,"Ä ":235,"ÄĄ":236,"Äą":237,"ÄŁ":238,"Ä€":239,"Ä„":240,"ÄŠ":241,"Ä§":242,"Äš":243,"Ä©":244,"ÄȘ":245,"Ä«":246,"ÄŹ":247,"Ä­":248,"Äź":249,"ÄŻ":250,"Ä°":251,"Ä±":252,"ÄČ":253,"Äł":254,"ÄŽ":255,"Ä”":256,"Ä¶":257,"Ä·":258,"Äž":259,"Äč":260,"Äș":261,"Ä»":262,"ÄŒ":263,"Äœ":264,"ÄŸ":265,"Äż":266,"Ć":267,"Ć":268,"Ć":269,"Ć":270,"an":271,"</":272,"al":273,"Ä <":274,"ed":275,"re":276,"at":277,"on":278,"er":279,"es":280,"en":281,"ion":282,"go":283,"bre":284,"breed":285,"qu":286,"tion":287,"ry":288,"cat":289,"ego":290,"im":291,"sw":292,"anim":293,"answ":294,"estion":295,"question":296,"catego":297,"animal":298,"answer":299,"category":300,"Ä f":301,"in":302,"Ä d":303,"and":304,".</":305,"?</":306,"ÄÄ":307,"Ä and":308,"ar":309,"ic":310,"ow":311,"ep":312,"Ä c":313,"is":314,"ent":315,"it":316,"Ä p":317,"arm":318,"gen":319,"eral":320,"general":321,"ff":322,"Wh":323,"ra":324,"eed":325,"Ä feed":326,"Ä farm":327,"What":328,"as":329,"Ä b":330,"ing":331,"epal":332,"ise":333,"em":334,"Ä m":335,"Ä on":336,"Ä do":337,"ck":338,"ric":339,"ali":340,"of":341,"th":342,"Ä N":343,"Ä in":344,"alij":345,"Ä dise":346,"Ä diseas":347,"Ä breed":348,"Ä a":349,"Ä l":350,"ement":351,"st":352,"row":353,"Ä pr":354,"ost":355,"Ä Nepal":356,"Ä diseases":357,"How":358,"Ä h":359,"ds":360,"ends":361,"Ä dep":362,"Ä depends":363,"ient":364,"icient":365,"fficient":366,"Ä g":367,"Ä e":368,"fes":369,"ifes":370,"pan":371,"Ä lifes":372,"Ä lifespan":373,"Ä re":374,"Ä of":375,"Ä go":376,"Ä ra":377,"rich":378,"ostrich":379,"bb":380,"bbit":381,"uff":382,"alo":383,"uffalo":384,"hic":385,"ken":386,"hicken":387,"kalij":388,"uck":389,"ig":390,"nepal":391,"ou":392,"ers":393,"ct":394,"va":395,"Ä va":396,"ation":397,"Ä farming":398,"ag":399,"anag":400,"Ä manag":401,"Ä management":402,"Ä is":403,"Ä th":404,"Ä the":405,"cc":406,"wit":407,"Ä wit":408,"Ä can":409,"Ä be":410,"Ä with":411,"Ä pro":412,"ire":413,"et":414,"ket":415,"arket":416,"Ä market":417,"di":418,"ein":419,"od":420,"ly":421,"Co":422,"lu":423,"eng":424,"ect":425,"ffect":426,"Ä affect":427,"Ä fas":428,"Ä grow":429,"Ä fast":430,"Efficient":431,"are":432,"sing":433,"quire":434,"Ä care":435,"Ä feeding":436,"Ä hou":437,"Ä require":438,"Ä good":439,"Ä housing":440,"Ä requires":441,"Grow":442,"Ä qu":443,"alit":444,"Growth":445,"Ä qualit":446,"Ä quality":447,"ondi":448,"tions":449,"Ä condi":450,"Ä conditions":451,"gi":452,"mm":453,"vent":454,"ygi":455,"revent":456,"ene":457,"ination":458,"Ä prevent":459,"Ä hygi":460,"Ä vacc":461,"Comm":462,"Ä prevented":463,"Ä hygiene":464,"Ä vaccination":465,"Common":466,"to":467,"Ä to":468,"fficiently":469,"Ä efficiently":470,"Ä raise":471,"Ä farms":472,"Ä eat":473,"ced":474,"lement":475,"pp":476,"su":477,"tein":478,"Ä su":479,"anced":480,"alanced":481,"Ä fed":482,"ins":483,"rains":484,"Ä balanced":485,"Ä are":486,"Ä grains":487,"Ä protein":488,"lements":489,"pplements":490,"Ä supplements":491,"ant":492,"Ä R":493,"cow":494,"goat":495,"rabbit":496,"buffalo":497,"chicken":498,"duck":499,"pig":500,"hal":501,"leng":502,"halleng":503,"hallenges":504,"Ä farmers":505,"Farm":506,"ab":507,"le":508,"itab":509,"ofitab":510,"Ä profitab":511,"Ä profitable":512,"Ä ostrich":513,"Ä cow":514,"Ä goat":515,"Ä buffalo":516,"Kalij":517,"eas":518,"heas":519,"Ä kalij":520,"Ä pheas":521,"Ä pheasant":522,"Ä chicken":523,"Ä rabbit":524,"Ä duck":525,"Ä pig":526,"am":527,"rn":528,"Is":529,"ce":530,"oc":531,"ur":532,"eck":533,"Ä Neck":534,"Bl":535,"ack":536,"Black":537,"un":538,"ish":539,"orn":540,"amp":541,"Pric":542,"gion":543,"Ä dem":544,"Ä by":545,"Ä region":546,"Ä vary":547,"Prices":548,"Ä demand":549,"Challenges":550,"clu":551,"de":552,"uation":553,"Ä flu":554,"Ä cost":555,"Ä inclu":556,"Ä disease":557,"ctuation":558,"Ä fluctuation":559,"Ä include":560,"Ä fluctuations":561,"ace":562,"Ä face":563,"Ä challenges":564,"Ä pric":565,"Ä price":566,"ai":567,"ces":568,"ran":569,"rces":570,"se":571,"sou":572,"ten":573,"use":574,"ze":575,"Ä use":576,"Ä bran":577,"Ä mai":578,"Ä loc":579,"Ä resou":580,"Ä often":581,"Farmers":582,"Ä maize":583,"Ä local":584,"Ä resources":585,"per":586,"ess":587,"Ä acc":588,"Ä proper":589,"Farming":590,"Ä access":591,"Mur":592,"rah":593,"Murrah":594,"hire":595,"shire":596,"Ni":597,"av":598,"li":599,"Ä Rav":600,"Nili":601,"Ä Ravi":602,"Red":603,"Af":604,"Ä Black":605,"rican":606,"African":607,"Jers":608,"ey":609,"Jersey":610,"Brow":611,"Sw":612,"Ä Sw":613,"iss":614,"Brown":615,"Ä Swiss":616,"Pe":617,"kin":618,"Pekin":619,"Fl":620,"Gi":621,"Ä Gi":622,"emish":623,"Flemish":624,"Ä Giant":625,"Ho":626,"lst":627,"Holst":628,"Holstein":629,"Blu":630,"Blue":631,"Cali":632,"forn":633,"ian":634,"Californ":635,"Californian":636,"In":637,"ner":638,"dian":639,"Ä Run":640,"Indian":641,"Ä Runner":642,"Ne":643,"Ze":644,"Ä Wh":645,"Ä Ze":646,"aland":647,"ite":648,"New":649,"Ä White":650,"Ä Zealand":651,"Camp":652,"Kh":653,"ak":654,"be":655,"ll":656,"Ä Camp":657,"Khak":658,"bell":659,"Ä Campbell":660,"Khaki":661,"Beng":662,"Ä Beng":663,"Ä Bengal":664,"Hamp":665,"Hampshire":666,"Rh":667,"land":668,"Ä Is":669,"ode":670,"Ä Red":671,"Rhode":672,"Ä Island":673,"Ply":674,"mou":675,"ock":676,"Ä Rock":677,"Plymou":678,"Plymouth":679,"Sa":680,"anen":681,"Saanen":682,"Jam":683,"ap":684,"ari":685,"unap":686,"Jamunap":687,"Jamunapari":688,"Corn":689,"Cornish":690,"Bo":691,"Boer":692,"Le":693,"gh":694,"Legh":695,"Leghorn":696,"Land":697,"race":698,"Landrace":699,"Ber":700,"kshire":701,"Berkshire":702,"Dur":703,"Duroc":704}